[
  {
    "rec_name": "Ingram Logan",
    "last_msg": "Quis do aliqua officia exercitation fugiat aliquip nostrud proident deserunt et ad dolor. Id quis proident ut ut elit velit ullamco aliqua labore proident. Sit ex sit enim aliquip et cupidatat pariatur.\r\n",
    "last_msg_sender": false,
    "last_msg_time": "2019-03-02T10:33:30+05:00",
    "last_msg_status": "read",
    "unread_count": 0,
    "active_chat": 0
  },
  {
    "rec_name": "Earnestine Peterson",
    "last_msg": "Veniam cillum aute non eiusmod consectetur laborum amet ullamco deserunt proident consectetur. Enim ea aliqua sit laboris eu dolore ex excepteur sunt mollit aliquip minim reprehenderit laborum. Dolor duis aute adipisicing proident do nulla eu pariatur adipisicing sit et aliqua.\r\n",
    "last_msg_sender": false,
    "last_msg_time": "2019-08-11T01:36:08+04:00",
    "last_msg_status": "delivered",
    "unread_count": 0,
    "active_chat": 1
  },
  {
    "rec_name": "Geneva Russo",
    "last_msg": "Adipisicing commodo exercitation veniam cupidatat culpa excepteur nisi fugiat quis. Aute reprehenderit elit sit nulla est veniam ad aute enim. Dolor Lorem incididunt velit in in cupidatat Lorem. Cupidatat do amet non eu deserunt.\r\n",
    "last_msg_sender": false,
    "last_msg_time": "2017-03-05T08:08:54+05:00",
    "last_msg_status": "delivered",
    "unread_count": 10,
    "active_chat": 0
  },
  {
    "rec_name": "Summer Montoya",
    "last_msg": "Labore ipsum voluptate pariatur duis voluptate ullamco laborum dolore. Aute adipisicing deserunt fugiat et excepteur dolor reprehenderit anim qui velit deserunt. Laboris minim occaecat ut esse duis nostrud commodo labore velit aliquip eiusmod.\r\n",
    "last_msg_sender": true,
    "last_msg_time": "2024-12-27T15:20:13+04:00",
    "last_msg_status": "read",
    "unread_count": 2,
    "active_chat": 0
  },
  {
    "rec_name": "Glover Levy",
    "last_msg": "Et ea enim commodo do esse anim anim reprehenderit ea laborum laboris ullamco occaecat laboris. Culpa nulla pariatur aute Lorem duis amet irure nostrud. Aliquip non excepteur anim in cupidatat occaecat proident duis non aliquip. Est irure Lorem proident Lorem nulla officia enim. Est officia aute cillum tempor minim sint magna qui do exercitation consectetur.\r\n",
    "last_msg_sender": true,
    "last_msg_time": "2018-02-26T11:06:46+05:00",
    "last_msg_status": "send",
    "unread_count": 2,
    "active_chat": 0
  },
  {
    "rec_name": "Reid Henson",
    "last_msg": "Minim sint sunt non exercitation commodo anim. Irure enim nostrud id proident laborum est nisi mollit esse. Consequat proident reprehenderit eu ipsum veniam deserunt ex. Dolore cupidatat ad sunt ipsum ad.\r\n",
    "last_msg_sender": true,
    "last_msg_time": "2023-01-15T08:47:16+05:00",
    "last_msg_status": "read",
    "unread_count": 2,
    "active_chat": 0
  },
  {
    "rec_name": "Bianca Hebert",
    "last_msg": "Proident excepteur reprehenderit nostrud Lorem proident cillum excepteur ut. Quis sint adipisicing nostrud pariatur dolor Lorem dolor cillum officia irure cupidatat nulla. In tempor ad dolor veniam nisi. Fugiat et deserunt incididunt culpa sint do aute deserunt magna exercitation consectetur ea. Amet non aliquip elit et. Velit fugiat dolor laboris sit ipsum id. Adipisicing veniam nisi voluptate labore laborum consectetur minim.\r\n",
    "last_msg_sender": true,
    "last_msg_time": "2021-09-09T09:14:46+04:00",
    "last_msg_status": "read",
    "unread_count": 2,
    "active_chat": 0
  },
  {
    "rec_name": "Gena Stephenson",
    "last_msg": "Id duis aliqua sint sunt irure ad voluptate aute enim. Dolor non esse ipsum labore do nulla do irure sunt ad sint incididunt. Magna adipisicing duis culpa irure excepteur aliquip et officia in nulla esse minim elit id. Labore amet veniam dolor cillum esse reprehenderit sit dolore irure. Labore labore in excepteur velit sit fugiat irure. Lorem in qui duis tempor fugiat non magna duis nulla labore ut Lorem. Nulla nisi eu laboris reprehenderit veniam sint esse officia reprehenderit pariatur magna magna excepteur.\r\n",
    "last_msg_sender": true,
    "last_msg_time": "2022-11-19T05:36:38+05:00",
    "last_msg_status": "read",
    "unread_count": 2,
    "active_chat": 0
  }
]